{
  "bio": "I have experience working in UX design, product development, electronics, and content creation. My work spans across designing digital platforms, prototyping smart hardware solutions, and creating engaging tech-focused content. I have been involved in structuring design systems, optimizing automotive digital experiences, and developing IoT-based electronics projects. Additionally, I create educational and storytelling content around technology and innovation, combining my skills in filmmaking and digital media production.",
  "skills": "User Experience & Product Design\nDesign Systems & UI Frameworks – Building scalable and reusable design systems\n\nUser-Centered Design – Researching and designing for intuitive and seamless digital experiences\n\nInteraction & Visual Design – Crafting engaging interfaces with strong usability principles\n\nAutomotive UX – Enhancing digital experiences in car buying and management platforms\n\nElectronics & Embedded Systems\nIoT & Smart Systems – Designing and prototyping smart electronics solutions\n\nEmbedded Programming – Working with microcontrollers and dev boards for automation projects\n\nHardware-Software Integration – Bridging physical and digital interactions through custom solutions\n\nContent Creation & Media Production\nFilmmaking & Video Production – Planning, shooting, and editing content for educational and commercial use\n\nTech Storytelling – Creating engaging narratives around technology and product development\n\nEducational Content – Developing tutorials, reviews, and breakdowns of emerging tech trends\n\nBusiness & Strategy\nInvestment & Financial Planning – Exploring scalable revenue models and financial growth opportunities\n\nMonetization of Digital & Hardware Products – Creating sustainable business models for tech-driven solutions\n\nCommunity-Driven Projects – Building and engaging audiences through valuable and innovative initiatives",
  "experience": "5 years of experiance in CARS24",
  "projects": "Enhancing User Experience for Cars24\n\nAt Cars24, you have:​\n\n​In the \"Cars24 AU App Onboarding\" project, the primary objective was to enhance user engagement and boost lead generation by redesigning the app's onboarding process. The existing flow permitted users to explore the app without logging in, resulting in high abandonment rates and limited lead generation. To address these issues, a login-first approach was implemented to build user trust and ensure higher conversion rates. ​\nMedium\n\nProblem Statement\n\nThe initial onboarding process allowed users to access the app without logging in, leading to:​\n\nHigh abandonment rates.​\n\nLow lead generation due to lack of early user information capture.​\nMedium\n\nUser hesitation in providing information without trust signals.​\n\nChallenges in adapting the onboarding process to the Australian market.​\nMedium\n+2\nMedium\n+2\nMedium\n+2\n\nResearch and User Understanding\n\nTo inform the redesign, the following research methods were employed:\n\nUser Behavior Analysis: Evaluated interactions with the previous onboarding process to identify drop-off points and engagement levels.​\n\nFeedback Collection: Gathered user insights to pinpoint pain points and areas needing improvement.​\n\nCompetitor Analysis: Studied onboarding flows of similar apps to identify best practices applicable to Cars24.​\n\nIdeation Phase\n\nKey elements considered during ideation included:\n\nTrust and Fast Content Consumption: Designed the onboarding flow to quickly convey trust and provide essential information, ensuring users feel secure and informed from the outset.​\n\nLead Generation and Process Clarity: Emphasized early user data capture while maintaining clear and straightforward steps for users.​\n\nFlow diagrams were created to outline distinct paths for new users, returning non-logged-in users, and returning logged-in users, each tailored to provide the most efficient and engaging onboarding experience.​\n\nContent Planning and Creation\n\nThe onboarding content was structured to include:\n\nWhat is Cars24?: Introduction to the platform and its mission.​\nMedium\n+2\nMedium\n+2\nMedium\n+2\n\nValue Propositions/Trust: Highlighted features such as a 7-day return policy, quality guarantees, and complimentary warranties.​\n\nProcess Clarity: Explained the online process, finance options, and customer reviews.​\n\nExisting marketing footage was repurposed to create concise, impactful content that effectively communicated these messages, building trust and engaging users.​\n\nFinal Design and Flow\n\nThe redesigned onboarding flow incorporated the above elements, leading to a more engaging and informative user experience.​\n\nConclusion\n\nThe implementation of the new onboarding process resulted in:​\nMedium\n\nA significant increase in app logins, enhancing lead generation for CRM purposes.​\nMedium\n\nImproved overall app experience with potential for more personalization.​\n\nApproximately 52% of users who encountered the login screen initiated the login process, while the remainder chose to skip it.​\n\nDespite a slight decrease in certain user engagement metrics, there was an increase in others, indicating that the new flow effectively filters out low-intent users during their first visit.​\n\nThis project underscores the importance of a well-designed onboarding process in building user trust and enhancing engagement.​\n\n\n\nSources\n\n\nDesigned user-friendly interfaces for Bikes24.​\n\nImproved the car discovery experience for Cars24 India.​\n\nCollaborated with S20.ai on an AI project to enhance car information clarity for users.​\n\nCurrently leading top-of-the-funnel projects for Cars24 Australia.​\n\nSocial E-commerce for Rural Bharat\n\nAs an early team member at Beet, a social commerce platform for India's Next Billion Users (NBUs), you:​\n\nSpecialized in research for community onboarding of NBUs.​\n\nDesigned UI/UX deliverables to make the product accessible to NBUs.​\n\nDeveloped strategies to facilitate digital commerce in rural and semi-urban areas.​\n\nBuilding Better Finance Culture for Bharat\n\nAs the founder of FinTrust, a financial app aimed at transforming personal finance management and building trust within networks, you:​\n\nLed a team of two developers in creating the application.​\n\nGained deeper insights into product development by integrating technology and business learnings.​\n\nFloral Resonance\n\nThis interactive art installation conveys the idea that flowers are afraid of humans due to environmental harm caused by human activities.​\n\nGoogle Internship Exercise\n\nIn your pursuit of a UX Designer Internship at Google, you completed a challenging design exercise that advanced to the next selection round. However, the opportunity was temporarily suspended due to the pandemic and lockdown.​\n\nIntelligent Vision\n\nIn the \"Intelligent Vision\" project, you explored image recognition technology with an emphasis on user-friendly design, aiming to make technology intuitive and enhance understanding of visual data processing.​\n\nThis summary reflects the diverse range of projects you've undertaken, showcasing your expertise in UX design, product development, and innovative problem-solving across various domains.\n\n",
  "interests": "Love ammus",
  "project_list": [
    {
      "id": "13613c49-7dec-469e-90ac-56ea284693f8",
      "title": "Test",
      "description": "Nothing",
      "category": "tech",
      "details": "Nothing",
      "content": "Cars24 AU aimed to improve user engagement and lead generation by redesigning the onboarding process of their app. The goal was to build user trust and ensure higher conversion rates through a login-first approach.\n\nProblem Statement\nThe initial onboarding flow allowed users to explore the app without logging in, leading to high abandonment rates and low lead generation. Users often left without providing any valuable information. Additional challenges included:\n\nCommunicating about the brand and Building Trust: Users were hesitant to provide information without trust signals.\nNew Experience for AU Market: Adapting the onboarding process to meet the expectations and preferences of the Australian market.\nOld flow\n\nIn the initial onboarding process, users could access the app without logging in, which led to high abandonment rates. This approach resulted in limited user engagement with key features, as many functionalities required logging in. Consequently, the lack of early user information capture led to low lead generation. The absence of a mandatory login step hindered the app’s ability to convert visitors into engaged users and collect valuable data for personalized experiences.\n\nResearch and User Understanding\nUser Behavior Analysis: Evaluated user interactions with the old onboarding process to understand drop-off points and engagement levels.\n\nFeedback Collection: Gathered insights from user feedback to identify pain points and areas needing improvement.\n\nCompetitor Analysis: Studied onboarding flows of similar apps to identify best practices and strategies that could be implemented in the Cars24 app.\n\n\nDuring the ideation phase , several key elements were considered to address the identified problems:\n\nTrust and Fast Content Consumption:\nThe onboarding flow was designed to quickly convey trust and provide essential information, ensuring users feel secure and informed from the start.\n\n2. Lead Generation and Process Clarity:\n\nEmphasising the importance of user data capture early in the process while maintaining clear and straightforward steps for the users.\n\nThe flow diagrams show distinct paths for new users, returning non-logged-in users, and returning logged-in users, each tailored to provide the most efficient and engaging onboarding experience. The new user flow includes a splash screen, followed by a trust and education step before prompting for login. Returning users bypass the trust step, streamlining their experience.\n\n\nContent Planning\nTo structure the onboarding content effectively, the following elements were prioritised, as shown\n\n\nWhat is Cars24?\n\nFuture of used car buying and selling.\nRedefining how Australians buy and sell cars.\nValue Propositions/Trust\n\n7-day return with a 100% money-back guarantee.\nQuality guarantee with comprehensive inspections by expert technicians.\n3-month warranty and roadside assistance complementary.\nProcess Clarity\n\n800+ cars to choose from the comfort of your home.\n100% online process.\n2-minute finance pre-approval & trade-in with competitive rates.\nRatings and Reviews\nOver 4000 happy customers.\nRatings from Google, Trustpilot, and Product Review.\nContent Creation\nTo deliver a compelling story and enhance user experience, old footages from Cars24 AU marketing were repurposed. Using storytelling and content creation skills, the existing footage was edited and reworked to create shorter, impactful content. This new content succinctly communicated the desired message, building trust and engaging users effectively.\n\nFinal design and Flow\n\nFinal flow video\n\nConclusion\nThere has been a massive increase in app logins which leads to:\n\n\nLead Generation for CRM purposes.\nBetter overall app experience and potential scope for more personalization.\nAround 52% of the users seeing the login screen initiate a login while the rest skip it.\nDespite a flat to slight decrease in U2BI/U2I and homepage landings, there has been a slight increase in U2Ph. This likely indicates that the new flow filters out low intent users during their first visit.",
      "created_at": "2025-03-24T16:24:17Z",
      "updated_at": "2025-03-24T16:39:55Z"
    }
  ],
  "name": "Ciril Cyriac",
  "location": "Bengaluru",
  "id": "754093fa-dca3-4ec8-892c-b278e3207dc1",
  "created_at": "2025-03-24T10:58:31.626237+00:00",
  "updated_at": "2025-03-24T11:09:01.948501+00:00"
}