{
  "bio": "I have experience working in UX design, product development, electronics, and content creation. My work spans across designing digital platforms, prototyping smart hardware solutions, and creating engaging tech-focused content. I have been involved in structuring design systems, optimizing automotive digital experiences, and developing IoT-based electronics projects. Additionally, I create educational and storytelling content around technology and innovation, combining my skills in filmmaking and digital media production.",
  "skills": "User Experience & Product Design\nDesign Systems & UI Frameworks – Building scalable and reusable design systems\n\nUser-Centered Design – Researching and designing for intuitive and seamless digital experiences\n\nInteraction & Visual Design – Crafting engaging interfaces with strong usability principles\n\nAutomotive UX – Enhancing digital experiences in car buying and management platforms\n\nElectronics & Embedded Systems\nIoT & Smart Systems – Designing and prototyping smart electronics solutions\n\nEmbedded Programming – Working with microcontrollers and dev boards for automation projects\n\nHardware-Software Integration – Bridging physical and digital interactions through custom solutions\n\nContent Creation & Media Production\nFilmmaking & Video Production – Planning, shooting, and editing content for educational and commercial use\n\nTech Storytelling – Creating engaging narratives around technology and product development\n\nEducational Content – Developing tutorials, reviews, and breakdowns of emerging tech trends\n\nBusiness & Strategy\nInvestment & Financial Planning – Exploring scalable revenue models and financial growth opportunities\n\nMonetization of Digital & Hardware Products – Creating sustainable business models for tech-driven solutions\n\nCommunity-Driven Projects – Building and engaging audiences through valuable and innovative initiatives",
  "experience": "Nopne",
  "projects": "Nopne",
  "interests": "Nopne",
  "name": "Ciril Cyriac",
  "location": "Bengaluru",
  "id": "754093fa-dca3-4ec8-892c-b278e3207dc1"
}